SOAP/src/test/resources/deleteTable.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.soap.tks.it.p.lodz.pl">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:deleteResourceRequest>
            <gs:id>test1</gs:id>
        </gs:deleteResourceRequest>
    </soapenv:Body>
</soapenv:Envelope>